Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.IsAnyDrawingOpen Method
 Returns information if any drawing is open.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsAnyDrawingOpen()
Public Function IsAnyDrawingOpen As Boolean
Return Value
Type: Boolean
True if a drawing is open or false if no drawing is open.
See Also
Reference
DrawingHandler Class
Tekla.Structures.Drawing Namespace